#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.catalog_builder_lambda.local_file.placeholder_code: Refreshing state... [id=64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e]
module.event_handler_lambda.local_file.placeholder_code: Refreshing state... [id=64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e]
data.aws_iam_openid_connect_provider.github_actions: Reading...
aws_iam_role.catalog_builder_lambda_role: Refreshing state... [id=hagrid-catalog-builder-role]
aws_ssm_parameter.okta_credentials: Refreshing state... [id=/hagrid/okta-credentials]
aws_ssm_parameter.app_context: Refreshing state... [id=/hagrid/app-context]
aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch-global]
aws_iam_role.event_handler_lambda_role: Refreshing state... [id=hagrid-event-handler-role]
module.dynamodb_tables.aws_dynamodb_table.conversations: Refreshing state... [id=hagrid-conversations]
aws_api_gateway_rest_api.hagrid_api: Refreshing state... [id=edt4hjfyae]
aws_cloudwatch_log_group.api_gateway_logs: Refreshing state... [id=/aws/apigateway/hagrid-api]
module.dynamodb_tables.aws_dynamodb_table.access_requests: Refreshing state... [id=hagrid-access-requests]
module.dynamodb_tables.aws_dynamodb_table.approval_messages: Refreshing state... [id=hagrid-approval-messages]
data.aws_iam_openid_connect_provider.github_actions: Read complete after 0s [id=arn:aws:iam::949134893249:oidc-provider/token.actions.githubusercontent.com]
data.aws_caller_identity.current: Reading...
aws_api_gateway_resource.slack: Refreshing state... [id=v5fbrr]
data.aws_caller_identity.current: Read complete after 0s [id=949134893249]
aws_iam_role.github_lambda_deploy: Refreshing state... [id=hagrid-lambda-deploy-role]
aws_api_gateway_resource.events: Refreshing state... [id=cxjf3c]
aws_iam_role_policy_attachment.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch-global-20260110193053516500000001]
aws_api_gateway_account.main: Refreshing state... [id=api-gateway-account]
aws_api_gateway_method.post_events: Refreshing state... [id=agm-edt4hjfyae-cxjf3c-POST]
aws_iam_role_policy.catalog_builder_lambda_ssm: Refreshing state... [id=hagrid-catalog-builder-role:hagrid-catalog-builder-lambda-ssm]
aws_iam_role_policy.catalog_builder_lambda_cloudwatch: Refreshing state... [id=hagrid-catalog-builder-role:hagrid-catalog-builder-lambda-cloudwatch]
module.catalog_builder_lambda.aws_lambda_function.function: Refreshing state... [id=hagrid-catalog-builder]
aws_iam_role_policy.github_lambda_deploy: Refreshing state... [id=hagrid-lambda-deploy-role:hagrid-lambda-deploy-policy]
aws_iam_role_policy.event_handler_cloudwatch: Refreshing state... [id=hagrid-event-handler-role:hagrid-event-handler-cloudwatch]
aws_iam_role_policy.event_handler_lambda_invoke: Refreshing state... [id=hagrid-event-handler-role:hagrid-event-handler-lambda-invoke]
aws_iam_role_policy.event_handler_ssm: Refreshing state... [id=hagrid-event-handler-role:hagrid-event-handler-ssm]
aws_iam_role_policy.event_handler_dynamodb: Refreshing state... [id=hagrid-event-handler-role:hagrid-event-handler-dynamodb]
module.event_handler_lambda.aws_lambda_function.function: Refreshing state... [id=hagrid-event-handler]
aws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-edt4hjfyae-cxjf3c-POST]
aws_api_gateway_deployment.prod: Refreshing state... [id=k8nb8g]
aws_api_gateway_stage.prod: Refreshing state... [id=ags-edt4hjfyae-prod]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.catalog_builder_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT -> null
        id                   = "64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e"
        # (9 unchanged attributes hidden)
    }

  # module.event_handler_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT -> null
        id                   = "64e3a7bf8f721ca2216614b8a3d1c3cfbf6b879e"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role.approval_manager_lambda_role will be created
  + resource "aws_iam_role" "approval_manager_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hagrid-approval-manager-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"    = "hagrid-approval-manager-role"
          + "Project" = "hagrid"
          + "Purpose" = "Execution role for approval manager Lambda"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-approval-manager-role"
          + "Project"   = "hagrid"
          + "Purpose"   = "Execution role for approval manager Lambda"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.conversation_manager_lambda_role will be created
  + resource "aws_iam_role" "conversation_manager_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hagrid-conversation-manager-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"    = "hagrid-conversation-manager-role"
          + "Project" = "hagrid"
          + "Purpose" = "Execution role for AI/NLP conversation manager Lambda"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-conversation-manager-role"
          + "Project"   = "hagrid"
          + "Purpose"   = "Execution role for AI/NLP conversation manager Lambda"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.okta_provisioner_lambda_role will be created
  + resource "aws_iam_role" "okta_provisioner_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hagrid-okta-provisioner-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"    = "hagrid-okta-provisioner-role"
          + "Project" = "hagrid"
          + "Purpose" = "Execution role for Okta provisioner Lambda"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-provisioner-role"
          + "Project"   = "hagrid"
          + "Purpose"   = "Execution role for Okta provisioner Lambda"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.approval_manager_cloudwatch will be created
  + resource "aws_iam_role_policy" "approval_manager_cloudwatch" {
      + id          = (known after apply)
      + name        = "hagrid-approval-manager-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-2:*:log-group:/aws/lambda/hagrid-approval-manager:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.approval_manager_dynamodb will be created
  + resource "aws_iam_role_policy" "approval_manager_dynamodb" {
      + id          = (known after apply)
      + name        = "hagrid-approval-manager-dynamodb"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-conversations",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-access-requests",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-approval-messages",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-conversations/index/*",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-access-requests/index/*",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-approval-messages/index/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.approval_manager_lambda_invoke will be created
  + resource "aws_iam_role_policy" "approval_manager_lambda_invoke" {
      + id          = (known after apply)
      + name        = "hagrid-approval-manager-lambda-invoke"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:us-east-2:*:function:hagrid-okta-provisioner"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.conversation_manager_cloudwatch will be created
  + resource "aws_iam_role_policy" "conversation_manager_cloudwatch" {
      + id          = (known after apply)
      + name        = "hagrid-conversation-manager-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-2:*:log-group:/aws/lambda/hagrid-conversation-manager:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.conversation_manager_dynamodb will be created
  + resource "aws_iam_role_policy" "conversation_manager_dynamodb" {
      + id          = (known after apply)
      + name        = "hagrid-conversation-manager-dynamodb"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-conversations",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-access-requests",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-approval-messages",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-conversations/index/*",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-access-requests/index/*",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-approval-messages/index/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.conversation_manager_ssm will be created
  + resource "aws_iam_role_policy" "conversation_manager_ssm" {
      + id          = (known after apply)
      + name        = "hagrid-conversation-manager-ssm"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:us-east-2:*:parameter/hagrid/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.okta_provisioner_cloudwatch will be created
  + resource "aws_iam_role_policy" "okta_provisioner_cloudwatch" {
      + id          = (known after apply)
      + name        = "hagrid-okta-provisioner-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-2:*:log-group:/aws/lambda/hagrid-okta-provisioner:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.okta_provisioner_ssm will be created
  + resource "aws_iam_role_policy" "okta_provisioner_ssm" {
      + id          = (known after apply)
      + name        = "hagrid-okta-provisioner-ssm"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:us-east-2:949134893249:parameter/hagrid/okta-credentials"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.approval_manager_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-approval-manager.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.approval_manager_lambda.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/placeholder/hagrid-approval-manager.zip"
      + function_name                  = "hagrid-approval-manager"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "hagrid-approval-manager"
        }
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-approval-manager"
          + "Project"   = "hagrid"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_REQUESTS_TABLE"     = "hagrid-access-requests"
              + "APPROVAL_MESSAGES_TABLE"   = "hagrid-approval-messages"
              + "CONVERSATIONS_TABLE"       = "hagrid-conversations"
              + "LOG_LEVEL"                 = "INFO"
              + "OKTA_PROVISIONER_FUNCTION" = "hagrid-okta-provisioner"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.approval_manager_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-approval-manager/index.py"
      + id                   = (known after apply)
    }

  # module.catalog_builder_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-catalog-builder.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.catalog_builder_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-catalog-builder/index.py"
      + id                   = (known after apply)
    }

  # module.conversation_manager_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-conversation-manager.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.conversation_manager_lambda.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/placeholder/hagrid-conversation-manager.zip"
      + function_name                  = "hagrid-conversation-manager"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "hagrid-conversation-manager"
        }
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-conversation-manager"
          + "Project"   = "hagrid"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_REQUESTS_TABLE"   = "hagrid-access-requests"
              + "APPROVAL_MESSAGES_TABLE" = "hagrid-approval-messages"
              + "CONVERSATIONS_TABLE"     = "hagrid-conversations"
              + "LOG_LEVEL"               = "INFO"
              + "SSM_PARAMETER_NAME"      = "/hagrid/app-context"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.conversation_manager_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-conversation-manager/index.py"
      + id                   = (known after apply)
    }

  # module.event_handler_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-event-handler.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.event_handler_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-event-handler/index.py"
      + id                   = (known after apply)
    }

  # module.okta_provisioner_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-okta-provisioner.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.okta_provisioner_lambda.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/placeholder/hagrid-okta-provisioner.zip"
      + function_name                  = "hagrid-okta-provisioner"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "hagrid-okta-provisioner"
        }
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-provisioner"
          + "Project"   = "hagrid"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_LEVEL"                 = "INFO"
              + "OKTA_CREDENTIALS_SSM_NAME" = "/hagrid/okta-credentials"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.okta_provisioner_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-okta-provisioner/index.py"
      + id                   = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + approval_manager_function_arn      = (known after apply)
  + approval_manager_function_name     = "hagrid-approval-manager"
  + conversation_manager_function_arn  = (known after apply)
  + conversation_manager_function_name = "hagrid-conversation-manager"
  + okta_provisioner_function_arn      = (known after apply)
  + okta_provisioner_function_name     = "hagrid-okta-provisioner"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @m0liere, Action: `pull_request`*